<template>
  <div class="vip-serve-view">
    <div class="nav-bar">
      <span class="left-arrow" @click="clickRouterUserVipServe"
        ><van-icon size="24" name="arrow-left"
      /></span>
      <span>会员服务协议</span>
    </div>
    <div class="user-vip-serve-text">
      <h1 align="center">享听会员服务协议</h1>
      欢迎您使用享听会员服务！<br />
      为使用享听会员服务（简称为：本服务），您应当事先阅读并遵守《享听会员服务协议》（简称为：本协议）。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的相应条款（特别提醒您留意本协议中加粗形式的条款内容），在开通或使用本服务前根据您的自由意思表示选择接受或不接受。<br />
      除非您已阅读并接受本协议所有条款，否则您无权使用本服务。您对本服务的任何购买和/或接受赠与等获取行为及登录、查看等任何使用行为即视为您已阅读并同意本协议的约束。<br />
      如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。

      <p>
        1.协议范围<br />
        1.1&nbsp;本协议是您与瞎扯公司之间关于用户使用享听高品质音乐服务所订立的协议。<br />
        “瞎扯公司”是指北京瞎扯科技有限公司及其相关服务可能存在的运营关联单位（以下统称为“瞎扯”或“瞎扯公司”）。<br />
        “用户”是指使用本服务的使用人，在本协议中更多地称为“您”。&nbsp;<br />
        “享听”是瞎扯公司提供的黑胶转数字音乐在线收听的高品质音乐服务，用户按照瞎扯公司指定的方式支付一定服务费用之后，可以享有一定的特权优惠或会员活动。<br />
        1.2&nbsp;享听高品质音乐服务的所有权和运营权，以及付费制度和活动制订权均归瞎扯公司所有，瞎扯公司在法律规定的范围内有解释权。<br />
        1.3&nbsp;享听高品质音乐服务秉承以下宗旨：为用户提供高品质的黑胶音乐，促进爱好黑胶音乐的用户之间、爱好黑胶音乐的用户与瞎扯公司之间的相互交流。<br />
        1.4&nbsp;瞎扯公司有权将其在本协议下的义务交由第三方履行，但瞎扯公司需承诺确保该第三方履行义务符合本协议的规定。
      </p>

      <p>
        2.会员服务的开通<br />
        2.1用户成为享听会员的方法：<br />
        您如果需要使用和享受享听会员服务，需要先登录您的享听帐号，或注册享听账号并登录。在成功登录后，您可以申请开通享听VIP会员服务。会员服务开通后，在会员有效期内，您即为享听会员，可以享受相应的会员权益；<br />
        您可通过各种已有和未来新增的渠道开通享听会员服务，现有方式包括:&nbsp;微信、支付宝、瞎扯币支付或者通过网银和银行卡等其他渠道支付一定费用。<br />
        2.2在您具体使用某种方式开通享听会员服务时，须仔细核对账号、开通服务类型、期限等具体信息，并确认同意相关的用户协议和使用方法。支付完成后，不可进行转让或要求退费。<br />
        2.3您不得实施下列任何行为：<br />
        （1）以营利、经营等非个人使用的目的为自己或他人开通享听会员服务；<br />
        （2）通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等程序、软件方式为自己或他人开通享听会员服务；<br />
        （3）通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通享听会员服务；<br />
        （4）通过非瞎扯指定的方式或违反《瞎扯用户服务协议》的方式为自己或他人开通享听会员服务；<br />
        （5）通过侵犯瞎扯或他人合法权益的方式为自己或他人开通享听会员服务；<br />
        （6）通过其他违反相关法律、行政法规、国家政策等方式为自己或他人开通享听会员服务。<br />
        否则，瞎扯公司有权立即终止向您提供的享听会员服务，并无须给予任何补偿、赔偿，无须退还您已支付的享听会员费用。
      </p>

      <p>
        3.会员服务的内容、服务期限<br />
        3.1您成功开通享听会员服务后可享受多项专属特权和服务，具体以瞎扯公司实际提供的为准。瞎扯公司可能会不定期的调整服务内容，调整的内容会在会员服务页面进行通知或公告，您需理解并知悉，对会员服务的调整可能会对您已享有或正在享有的权益造成影响，如您不同意前述调整，应在当期服务期限届满后停止使用会员服务。否则，您同意继续购买、支付、使用会员服务的行为，将视为您同意并接受前述调整。<br />
        3.2会员服务的期限：以您在会员服务页面中自行选择并支付相应费用的期限为准，服务期限自服务开通之日起计算。服务期限届满后，瞎扯公司将停止继续向您提供会员服务。您若希望继续开通会员服务，可通过续费恢复会员资格。<br />
        3.3如您开通自动续费服务，瞎扯公司将在会员有效期到期日前1日自动在账户扣费并延长对应的会员有效期，如需要取消自动续费服务，请参照《自动续费服务规则》的约定进行操作。
      </p>

      <p>
        4.会员资格权益的有关规定<br />
        4.1在享听会员服务有效期内，您可拥有享听完整音乐的播放权限，并有机会享有部分优惠及增值服务。&nbsp;<br />
        4.2您开通享听会员服务后，在已开通的会员服务期内中途主动取消会员服务或终止会员资格的，已支付的费用将不予退还。<br />
        4.3基于版权方的要求，您在开通会员服务期间下载的歌曲，可能有部分歌曲仅可在您使用的下载终端（即指下载歌曲时使用的终端设备）本地进行播放或收听，不能进行复制或拷贝至其他终端设备。非下载终端设备或享听会员服务期届满/到期的，已下载的歌曲将无法进行播放或收听。<br />
        4.4&nbsp;享听会员的多项特权服务和增值服务仅限在您的享听会员账号内享有，不能在其他账号之间转移或共享。
      </p>

      <p>
        5.会员用户守则&nbsp;<br />
        5.1您需确保注册资料的真实性。在开通享听会员服务填写注册资料时，您要确保所填写的信息是真实有效的。如果因注册信息不真实而引起的问题，并对问题发生所带来的后果，瞎扯公司不承担任何责任。&nbsp;
        <br />
        5.2您必须遵守《享听会员服务协议》、《瞎扯用户服务协议》、《隐私政策》以及其他在瞎扯网站公示的规则，不得实施任何违法行为，不得侵犯其他任何第三人的合法权益。您需理解并同意，如果瞎扯公司发现或收到他人举报您有违法违约行为的，瞎扯公司有权依法进行独立判断并采取技术手段予以删除、屏蔽或断开相关的信息。同时，瞎扯公司有权视您的行为性质，对您采取包括但不限于暂停或终止部分或全部会员服务、追究您法律责任等措施，瞎扯公司也无需向您退还任何费用，而由此给您带来的损失（包括但不限于相关数据清空、未使用的服务费用作为违约金而归瞎扯公司所有等），由您自行承担。<br />
        5.3会员服务及相关权益仅限您本人使用，不得出借、转让、赠与或售卖。您应自行负责妥善保管、使用、维护您在享听取得的会员账号、账号信息及账号密码。非瞎扯公司原因致使您账号密码泄漏以及因您保管、使用、维护不当造成损失的，瞎扯公司无须承担与此有关的任何责任。<br />
        5.4您充分理解并同意，您须为自己会员账号下的一切行为负责，包括您所发表的任何内容、信息及由此产生的相应法律责任和后果。若您违反本条约定，导致任何第三方损害的，您应当独立承担责任，瞎扯因此遭受损失的，您也应当一并赔偿。<br />
        5.5您理解并同意：瞎扯公司向您提供的服务，可能包含瞎扯公司经合法权利人授权而向您提供的相关服务，因此，由于该权利人对瞎扯公司授权时间、范围、限制等约束，瞎扯公司会对您开通会员服务的地区以及具体使用服务的时间、地区等做一定限制，可能会导致您在一定的地区或时间等情况下无法获得会员服务，包括但不限于您在仅可在中国大陆地区（不含香港、澳门、台湾等地区）范围内开通并使用享听会员服务，如果您在中国大陆地区之外或者使用的是非中国大陆地区之网络/设备等，则无法使用/获得会员服务。对于因为前述原因或其他原因造成用户无法享有会员服务的，瞎扯公司无需承担任何责任。
      </p>

      <p>
        6.个人信息保护<br />
        6.1您在开通享听会员服务过程中，可能需要填写一些必要的信息，请保持这些信息的及时更新，以便瞎扯向您提供帮助，或更好地为您提供服务。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整或不准确，则可能无法正常使用服务或在使用过程中受到限制。<br />
        6.2尊重会员个人隐私是瞎扯公司的责任，瞎扯公司在未经您的授权时不会公开、编辑或透露您的注册资料及保存的非公开内容，法律法规或本协议另有规定的除外。&nbsp;<br />
        6.3如发生下列任一情况，瞎扯公司有权对您的信息予以披露：<br />
        （1）经您同意披露的；<br />
        （2）根据法律的有关规定，或者行政或司法机构的要求，向他人或者行政、司法机构披露的；<br />
        （3）如果您违反有关法律、法规、规章、政策的，需要向他人披露的；<br />
        （4）其它瞎扯公司为用户服务目的而认为合适披露的；<br />
        （5）其他依法或依约瞎扯公司可以披露的情形。<br />
        6.4详细隐私政策请见《隐私政策》。
      </p>

      <p>
        7.未成年人保护<br />
        7.1&nbsp;瞎扯公司非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用享听会员服务前，应事先取得您监护人的同意。<br />
        7.2&nbsp;依据我国相关法律对于未成年人民事行为效力的规定，为保护未成年人在使用本会员服务过程中的权益，未成年人在进行会员服务充值及消费等行为前，应事先取得您监护人的同意。若完成充值行为后，未成年人和/或其监护人主张该充值行为无效的，瞎扯公司支持退还相应充值金额，请与本平台客服联系，核实情况属实后瞎扯将退还充值金额。若完成充值行为后进行消费，未成年人和/或其监护人主张该消费行为无效的，瞎扯公司不承担退还相应消费金额的责任，亦不得因此要求瞎扯作任何补偿或赔偿。
      </p>

      <p>
        8.会员服务的通知和公告办法&nbsp;<br />
        享听会员服务通知和公告形式包括但不限于以下形式之一或多种形式：<br />
        （1）享听网站或客户端；（2）电子邮件；（4）瞎扯公司主站的公告专栏。&nbsp;<br />
        会员服务条款的修改，服务内容变更，或其他重要事件的通告都会以上述形式进行。
      </p>

      <p>
        9.免责声明<br />
        9.1如果您行使本协议规定的权利而购买/接受瞎扯公司以外的第三方商户提供的商品或服务，如因此发生纠纷的，您应向销售/提供该商品或服务的第三方商户主张权利，与瞎扯公司无关。<br />
        9.2您须对您自身及您所邀请的宾客在参加瞎扯公司组织的活动或使用由瞎扯公司提供的各项优惠及增值服务时的实施的一切行为承担全部法律责任。<br />
        9.3瞎扯公司不对您因第三方的行为或不作为造成的损失、不可抗力原因造成的损失承担任何责任，包括但不限于支付服务、网络接入服务、电信部门的通讯线路故障、通讯技术问题、网络、电脑故障、系统不稳定性、任意第三方的侵权行为等。<br />
        9.4您理解并同意，在使用享听会员服务的过程中，可能会遇到不可抗力等风险因素，使该服务发生中断。如出现上述情况，瞎扯公司承诺将尽快与相关单位配合进行修复，但不承担由此对您造成的任何损失且不退还付费会员费用。
      </p>

      <p>
        10.服务的变更、中止或终止<br />
        10.1您需理解并同意，由于互联网服务的特殊性，瞎扯公司可能会按照相关法规、双方约定或在其他必要时，中止或终止向您提供本服务。<br />
        10.2您充分理解并同意，若因版权原因需调整、更改或下线有关作品内容，瞎扯公司有权根据实际情况，在不通知您的情况下中断或终止向您提供的一项或多项作品内容，对于因为前述原因或其他原因造成您无法获取所需作品内容，瞎扯公司不承担任何责任且无需给予任何形式的补偿和退费。<br />
        10.3如发生下列任何一种情形，瞎扯公司有权取消您的享听会员资格。瞎扯公司可随时根据实际情况不经通知而中断或终止向您提供的一项或多项或全部服务：<br />
        （1）根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；<br />
        （2）您违反相关法律法规或本协议的约定；<br />
        （3）按照法律规定或主管部门的要求；<br />
        （4）出于安全的原因或其他必要的情形；
      </p>

      <p>
        11.协议的生效与变更<br />
        11.1您使用瞎扯的服务即视为您已阅读本协议并接受本协议的约束。<br />
        11.2瞎扯公司有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条款。对协议条款的修改，会以通告形式公布于享听首页等重要页面上，一经公布即视为通知用户。<br />
        11.3本协议条款变更后，如果您继续使用瞎扯公司提供的软件或服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用瞎扯公司提供的软件或服务。
      </p>

      <p>
        12.&nbsp;其他<br />
        12.1本协议内容同时包括《瞎扯用户服务协议》（链接地址：http://享听.kuwo.cn/regterm.html，若链接地址变更的，则以变更后的链接地址所对应的内容为准；其他链接地址变更的情形，均适用前述约定。）、《隐私政策》（链接地址：http://享听.kuwo.cn/webterm.html）及瞎扯可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。上述内容与本协议存在冲突的，以本协议为准。您对前述任何业务规则、协议的接受，即视为您对本协议全部的接受。<br />
        12.2本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。<br />
        12.3因本协议引起的或与本协议有关的任何争议，双方应友好协商解决，协商不成的，您同意将纠纷或争议提交青岛仲裁委员会按照其仲裁规则在北京进行仲裁。仲裁是终局的，对双方均有约束力。<br />
        12.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。<br />
        12.5本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
      </p>

      <p>
        北京瞎扯科技有限公司<br />
        2021年8月30日
      </p>
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    clickRouterUserVipServe() {
      this.$emit("clickRouterUserVipServe", false);
    },
  },
};
</script>

<style lang="scss" scoped>
.vip-serve-view {
  width: 100vw;
  height: 100vh;
  position: fixed;
  top: 0;
  bottom: 0;
  left: 0;
  background-color: rgb(240, 240, 240);
  z-index: 20;
  overflow: auto;
  padding-top: 65px;

  .nav-bar {
    position: fixed;
    top: 0;
    left: 0;
    width: 100vw;
    height: 55px;
    text-align: center;
    line-height: 55px;
    box-shadow: 0px 0px 10px #f7f5f5;
    font-size: 20px;
    background-color: #fff;

    .left-arrow {
      position: absolute;
      top: 0;
      left: 20px;
    }
  }
   .user-vip-serve-text {
    font-family: sans-serif;
    font-size: 16px;
    line-height: 180%;
    overflow-x: hidden;
    word-break: break-all;
    padding: 0px 20px 80px;
    box-sizing: border-box;
    background-color: #fff;
  }
}
</style>